{
  "About": {
    "Me": {
      "part1": "I am a seasoned Front-End Web Development leader with a passion for front-end development with over 15+ years of experience delivering user-centered, innovative, high-performance digital solutions across industries, including healthcare, finance, education, multimedia, security, and technology. Proven experience in React, JavaScript, TypeScript, HTML, CSS, and in UI frameworks such as Next.js and AngularJS, Skilled in building scalable, accessible interfaces, leading development teams, and implementing reusable component libraries. Adept at driving performance, mentoring junior engineers, and streamlining development through Agile methodologies and testing best practices. Passionate about continuous learning, innovation, and delivering seamless user experiences across platforms.",
      "part2": "Throughout my career, I have served in strategic engineering roles where I not only built mission-critical applications, but also mentored development teams, established coding standards, and championed accessibility and usability. From leading multi-disciplinary teams at firms like Edward Jones, and FlashPoint, to spearheading UI modernization projects using cutting-edge technologies and Agile practices, I have earned a reputation for transforming vision into execution while elevating team capabilities and user experience outcomes.",
      "part3": "My unique blend of artistic training—holding an MFA in Interactive Media and a BFA in Graphic Design—and technical mastery allows me to bridge the gap between design and engineering, consistently delivering front-end experiences that are not only functional but intuitive and engaging. My leadership in building reusable component libraries, streamlining CI/CD pipelines, and advocating for test-driven development has resulted in faster releases, reduced defects, and improved team productivity.",
      "part4": "I am passionate about mentorship, continuous learning, and clean code, I remain at the forefront of front-end innovation, regularly pushing the boundaries of what digital products can deliver. A lifelong Eagle Scout, I bring the same dedication and discipline to my professional career—grounded in integrity, and an unwavering commitment to excellence."
    }
  },
  "Testimonials": {
    "ChandlerPrince": {
      "name": "Chandler Prince",
      "quote": "Heath is a great person to have on your project. He's willing to share information, he's proactive, and he's passionate about his work. I hope I have the opportunity to work with him again in the future.",
      "company": "Charter"
    },
    "AmandaPozzo": {
      "name": "Amanda Pozzo",
      "quote": "It is a genuine pleasure and honor for me to recommend Heath Bishop. Heath worked in the Visual Design department at Real Estate Educate. He began here as Junior Flash Developer and rapidly mastered the skills required to develop first-rate online training courses.  Heath is an excellent coder, able to work well in a demanding environment. He independently completes projects to the highest standard and on time. He effectively collaborates with his team, implementing object-oriented design to improve our course development.  I have no hesitation in recommending Heath Bishop for any position pertaining to web development. I feel confident he would be an asset to any employer.  Sincerely,  Amanda Pozzo SVP/Director of Operations, Real Estate Educate",
      "company": "Real Estate Educate"
    },

    "JamesJervis": {
      "name": "James Jervis",
      "quote": "I had the pleasure of knowing Heath Bishop for 7 months.  During that time he worked for Real Estate Educate, as a Junior Flash AS2/AS3 Developer.  Heath has great coding skills and is willing to work to find the appropriate solution for the project at hand.  His work on our core coding structures has pushed us forward by providing a better, cleaner and more usable AS3 framework.  Heath has a genuine interest in coding.  He takes to new concepts quickly and readily implements them where they are needed and/or useful.  He is always interested in learning new coding techniques and grasps the concepts quickly.  I would recommend him for any position or career that he may now choose to pursue.  Sincerely,  Jame Jervis VP/Director Development and Production Real Estate Educate",
      "company": "Real Estate Educate"
    },

    "RobertWade": {
      "name": "Robert Wade",
      "quote": "It was a pleasure to work together with Heath, who was an efficient ActionScript Developer. During Heath's time with the company he created customized components, interactions, and built our class structure using ActionScript 3.0. Heath demonstrated excellent coding practices utilizing proper OOP methods and UML. Heath is an extremely fast learner. If there was something that Heath did not know, he was very prompt in figuring out a way to solve anything we threw his way. Heath would be an excellent asset to any company therefore, I would recommend Heath to anyone looking for an Web Developer.  Robert Wade Team Leader of Visual Design Department Real Estate Educate.",
      "company": "Real Estate Educate"
    },

    "StevenWilliams": {
      "name": "Steven Williams",
      "quote": "It has been my pleasure and high honor to work with Heath Bishop.  He has shown himself professional and above reproach in all his performance and duties as a software developer.  Heath has been eager to learn and always held a positive attitude.  I have no doubt he will be an incredible asset wherever he finds himself.",
      "company": "Master Key Interactive"
    }
  }
}
