{
  "Profile": "Seasoned Front-End Web Developer with over 20 years of experience delivering high-quality, user-centered digital solutions across diverse industries including healthcare, finance, education, and technology. Proven expertise in React, JavaScript, TypeScript, HTML/CSS, and modern UI frameworks such as Next.js and AngularJS. Skilled in building scalable, accessible interfaces, leading development teams, and implementing reusable component libraries. Adept at driving performance, mentoring junior engineers, and streamlining development through Agile methodologies and testing best practices. Passionate about continuous learning, innovation, and delivering seamless user experiences across platforms.",
  "Technologies": {
    "Languages": "TypeScript, JavaScript, HTML, HTML5, CSS3, JSON, XML",
    "Tools / Libraries": "React, Redux, Next.js, AngularJS, Material, Bootstrap, SCSS, Tailwind, jQuery, ESLint, Node, NPM, Express, Webpack, Jest, GIT, GitLab, GraphQL, Bitbucket, Jasmine, Jenkins, Agile, Scrum, Kanban Methodologies",
    "Software": "WebStorm, Visual Studio Code, Eclipse, IntelliJ, Fiddler, Postman, Adobe Photoshop, Adobe Illustrator, Adobe XD, Confluence, JIRA, Figma",
    "Operating Systems": "Windows, Mac OS"
  },
  "IndustryExperience": "Energy, Restaurant, Communication, Commodity Trading, Sports, Healthcare, Pharmacy Tech, Insurance, Integrated Digital Technologies, Marketing, Financial, Education, Automotive, Railroad, and Beverage",
  "Competencies": "My competencies encompass a broad spectrum of UI Design and Development, UI Architecture, Project Design and Development, Framework Development, Object-Oriented Programming, User Experience (UX), and Usability. This comprehensive skill set enables me to deliver high-quality solutions across various projects.",
  "Experience": [
    {
      "company": "Optum Rx",
      "contract": true,
      "position": "Front-end Developer",
      "location": "St. Louis, MO",
      "date": "February 2025 - June 2025",
      "description": "Led the building of the front end for an AI project.",
      "details": [
        "Collaborated with a team of UI developers to design and implement a user interface for an AI-driven application using Agile methodologies.",
        "Mentored and supported junior developers, providing guidance on best practices and code reviews.",
        "Developed custom, reusable UI components to enhance consistency and efficiency across the engineering team.",
        "Engineered a creative solution to integrate a non-native dropdown menu with the Formik library, demonstrating problem-solving and adaptability."
      ],
      "clients": [],
      "used": "Agile Development, React, Nextjs, TypeScript, ESLINT, Prettier, Tailwind, MSW, Storybook, and Playright"
    },
    {
      "company": "Lutheran Church Missouri Synod",
      "contract": false,
      "position": "Product Designer/Developer",
      "location": "St. Louis, MO",
      "date": "June 2023 - October 2023",
      "description": "Led the redesign and development of their Prayer Cards website.",
      "details": [
        "Led the redesign of the Prayer Cards website, significantly improving usability and visual design; presented to stakeholders and received strong approval.",
        "Resolved major Bootstrap and mobile compatibility issues across four public-facing websites, boosting accessibility and user experience.",
        "Refactored and updated Bootstrap codebase while creating custom CSS to fix grid-related bugs, ensuring consistent performance across devices",
        "Utilized design tools like Adobe XD, Illustrator, and Photoshop to align UI/UX improvements with brand and accessibility standards."
      ],
      "clients": [],
      "used": "Agile Development, React, Webpack, Node.js, Module.CSS, HTML, TypeScript, ESLint, Prettier, Jest"
    },
    {
      "company": "Charter Spectrum",
      "contract": true,
      "position": "Senior Software Engineer 1",
      "location": "St. Louis, MO",
      "date": "November 2022 - December 2022",
      "description": "Led and mentored a team of software engineers to update an older class based Reactjs project with new functionality and better performance.",
      "details": [
        "Led a development team at Spectrum to optimize React.js and Next.js applications, cutting development time by 32% through testing strategies and adoption of best practices.",
        "Mentored developers by teaching modern workflows, CSS fundamentals, and legacy React concepts to revive and accelerate a stalled project.",
        "Improved code quality and consistency by integrating tools like ESLint, Prettier, and Jest into the development pipeline.",
        "Applied Agile methodologies to enhance team collaboration, increase productivity, and ensure timely project delivery."
      ],
      "clients": [],
      "used": "Agile Development, React, Webpack, Node.js, Module.CSS, HTML, TypeScript, ESLint, Prettier, Jest"
    },
    {
      "company": "FLASHPOINT",
      "contract": false,
      "position": "Senior Software Engineer",
      "location": "St. Louis, MO",
      "date": "July 2022 - September 2022",
      "description": "Led multiple teams of software engineers to build a new Reactjs-based library and a new Reactjs product that will replace their outdated product.",
      "details": [
        "Led multiple teams at FlashPoint through full project lifecycles, from concept to successful implementation.",
        "Spearheaded the creation of a reusable front-end component library, accelerating development across teams.",
        "Ensured code quality and consistency by enforcing standards with ESLint, Prettier, and Jest.",
        "Employed Agile methodologies and modern technologies such as Next.js, TypeScript, and CSS Modules to deliver scalable solutions."
      ],
      "clients": [],
      "used": "Agile Development, React, Webpack, Node.js, Module.CSS, HTML, TypeScript, ESLint, Prettier, Storybook"
    },
    {
      "company": "QUES",
      "contract": false,
      "position": "Senior UI Engineer",
      "location": "St. Louis, MO",
      "date": "October 2021 - July 2022",
      "description": "I worked with a team of developers to build and maintain different SAAS projects.",
      "details": [
        "Spearheaded the development of a React-based UML display tool, allowing users to build, edit, and save diagrams efficiently.",
        "Contributed to the architecture of a new React project, enhancing overall system functionality and scalability.",
        "Maintained and upgraded legacy AngularJS applications to ensure smooth integration with new React-based components.",
        "Implemented performance and UX improvements through strategic upgrades, maintaining high code quality with ESLint and Jest."
      ],
      "clients": [],
      "used": "Agile Development, React, Angular, Webpack, Node.js, Sass, HTML, CSS, TypeScript, ESLint, Prettier"
    },
    {
      "company": "Edward Jones",
      "contract": false,
      "position": "Senior Front End Developer",
      "location": "St. Louis, MO",
      "date": "March 2020 - October 2021",
      "description": "I worked with a team of Senior developers to mentor and aid other UI development teams using React.",
      "details": [
        "Spearheaded the development of reusable animated components, enhancing UI consistency and promoting code efficiency across multiple teams.",
        "Delivered training on React accessibility standards, improving inclusivity and usability in codebases.",
        "Led workshops on React best practices, driving performance optimizations, and elevating code quality.",
        "Designed screen architectures and established testing standards, reducing redundant code while increasing test coverage and reliability."
      ],
      "clients": [],
      "used": "Agile Development, React, Redux, Webpack, Node.js, Sass, HTML, CSS, JavaScript, ESLint"
    },
    {
      "company": "RGA",
      "contract": true,
      "position": "Senior Front End Developer",
      "location": "St. Louis, MO",
      "date": "July 2019 - March 2020",
      "description": "Led a team of software engineers to update the Aurora project from AngularJS to Reactjs and Redux, and give it a modern look using Material design.",
      "details": [
        "Lead the charge to improve User Experience by bringing to light potential usability issues and offering solutions before they became a problem.",
        "Lead the team to improve accessibility by running international accessibility compliance tests and fixing all found issues.",
        "Sped up development by teaching the other developers React, CSS, and good coding practices.",
        "Sped up development by updating all obsolete NPM packages and upgrading to a multithreaded version of Nodejs."
      ],
      "clients": [],
      "used": "Agile Development, React, AngularJS, TypeScript, Jasmine, Webpack, Node.js, Sass, HTML, CSS, JavaScript, ESLint, TSLint"
    },
    {
      "company": "NECES",
      "contract": true,
      "position": "Senior UI Developer",
      "location": "St. Louis, MO",
      "date": "March 2019 - July 2019",
      "description": "Led a team of onshore and offshore UI software engineers to build the AUROS Command and AUROS Site Manger projects.",
      "details": [
        "Led the UI team to enhance AUROS projects by establishing standards and comprehensive documentation, boosting development efficiency.",
        "Implemented testing frameworks such as Jest, Jasmine, and Karma to reduce bugs and improve overall software quality.",
        "Conducted operational reviews to streamline development processes, significantly decreasing post-production changes.",
        "Guided the team through architecture improvements and Angular 7 upgrades, successfully achieving key project milestones."
      ],
      "clients": [],
      "used": "Agile Development, Angular, TypeScript, Jasmine, Karma, Protractor, Webpack, Node.js, Sass, HTML, CSS, JavaScript"
    },
    {
      "company": "Panera Bread",
      "contract": true,
      "position": "Senior UI Developer",
      "location": "St. Louis, MO",
      "date": "March 2018 - March 2019",
      "description": "Rebuilding Panera's Point-of-Sale devices.",
      "details": [
        "Collaborated on developing the UI, enhancing usability and efficiency for the Point-of-Sale system used in their restaurants.",
        "Led the initiative to reorganize the code, standardize code patterns, and implement Jest to increase code coverage."
      ],
      "clients": [],
      "used": "React.js, Redux,js, Axios.js, Saga.js, Jest, JavaScript, JSON, HTML, CSS, LESS, Webpack, Node.js, Intellij"
    },
    {
      "company": "Daugherty Business Solutions",
      "contract": false,
      "position": "Software Engineer",
      "location": "St. Louis, MO",
      "date": "August 2013 - March 2018",
      "description": "Member of the Software Architecture and Engineering Line of Service.",
      "details": [],
      "used": "",
      "clients": [
        {
          "company": "Charter Communications",
          "description": "Redeveloped Customer Service Management website.",
          "details": [
            "Redeveloped the Customer Service Management website as part of the Gateway Project, improving functionality and user experience.",
            "Resolved a complex Bootstrap dropdown menu bug by implementing a unique solution that enhanced UI usability. - Became usable no matter where on the screen it was placed and no matter how many items where in the menu. (2016)",
            "Developed a custom event-based library for global state management using React, JavaScript, and HTML, demonstrating strong front-end expertise",
            "Collaborated on rewriting critical Trading System components, migrating business logic to managed .NET code to boost system efficiency and maintainability"
          ],
          "used": "Agile Development, React.js, JavaScript, HTML, CSS, Node, Webpack, NPM, Bootstrap, JSON"
        },
        {
          "company": "Metal Exchange Corporation",
          "description": "Redeveloped Trading System.",
          "details": [
            "Collaborated to rewrite two major components of the Trading System, the Pricing Engine and Broker Invoice Engine.",
            "Rewrote multiple SQL stored procedures to move business logic from SQL to managed .Net code.",
            "Built unit test and / or integration test for new and existing code."
          ],
          "used": "Agile Development, Dependency Injection, Design Patterns, Moq, MVC, C#, VB, MS SQL, ASP, HTML, JavaScript, Visual Studio 2010, MS SQL Server Management Studio, Fiddler"
        },
        {
          "company": "Express Scripts",
          "description": "Redeveloped their Automated Prescription Processing System.",
          "details": ["Developed key functionality for the new system."],
          "used": "Agile development, dependency injection, design patterns, C#, WPF, ASP, HTML, Oracle, Visual Studio"
        }
      ]
    },
    {
      "company": "FleishmanHilliard Inc.",
      "contract": true,
      "position": "Front End Developer",
      "location": "St. Louis, MO",
      "date": "May 2013 - July 2013",
      "description": "Built and updated client websites.",
      "details": [],
      "used": "",
      "clients": [
        {
          "company": "Goldcorp Inc.",
          "description": "Redeveloped the Career section of their current website.",
          "details": [
            "Co-developed the strategy to migrate the existing pages from an obsolete CMS to ASP.Net",
            "Developed the front-end master page and content pages using C# and ASP.Net.",
            "Developed the logic and wrote the ASP code that linked to the MS SQL database and processed and displayed the data based on user interactions."
          ],
          "used": "C#, ASP, HTML, CSS, JavaScript, jQuery"
        },
        {
          "company": "AT&T Inc",
          "description": "Rebuilt the Sustainability pages of their website.  Helped develop the driving simulator portion of the “It can wait” campaign.",
          "details": ["Rebuilt the People and Community, Environment, and Technology web pages based on artist wireframes and comps.", "Debugged the Web and Unity engine portion of the driving simulator."],
          "used": "HTML, CSS, JavaScript, jQuery, Adobe Flash"
        },
        {
          "company": "Chevrolet",
          "description": "Built the MyLink simulator that appeared on Chevy’s Facebook page.",
          "details": ["Built the simulator based on artist designs and Facebook requirements."],
          "used": "HTML, CSS, JavaScript, jQuery, Facebook API"
        },
        {
          "company": "Panda Power Funds",
          "description": "Rebuilt the career page on their current site.",
          "details": ["Rebuilt the career page of their website to be more flexible and accommodate their new design."],
          "used": "HTML, CSS, JavaScript, jQuery"
        }
      ]
    },
    {
      "company": "Freelance Developer",
      "contract": false,
      "position": "Software Consultant",
      "location": "St. Louis, MO",
      "date": "Nov 2011 - May 2013",
      "description": "Designed and developed a variety of software, and e-Learning products for clients.",
      "details": [],
      "used": "",
      "clients": [
        {
          "company": "CSX Transportation.",
          "description": "Developed e-Learning module to educate their work force on the proper safety procedures.",
          "details": ["Developed the module to include video and a quiz."],
          "used": "Adobe Flash, XML, HTML, SCORM"
        },
        {
          "company": "Coca-Cola",
          "description": "Developed a PC and iOS application that is used by their sales force.",
          "details": ["Developed the logic and the strategy to move the project forward.", "Developed the framework to support the application.", "Programmed the application to run in Windows and the iOS."],
          "used": "Adobe Flash, Adobe Air, XML, HTML, JavaScript"
        },
        {
          "company": "University of Missouri – Columbia",
          "description": "Team leader to design and development of software on genetics for elementary age children.",
          "details": ["Was responsible for the design and development of the game portion that incorporated a physics engine."],
          "used": "Adobe Flash, XML, HTML"
        },
        {
          "company": "Fiat Chrysler ",
          "description": "Developed an e-Learning module to educate their sales force about towing requirements.",
          "details": ["Developed the module to include video and a quiz."],
          "used": "Adobe Flash, XML, HTML, SCORM"
        },
        {
          "company": "Callaway Golf Company",
          "description": "Developed an e-Learning module to educate customers on their new line of RAZR irons and woods.",
          "details": ["Developed the framework to support the module and server communication using SOAP.", "Developed the module to include video, animations, a quiz, and quiz reporting"],
          "used": "Adobe Flash, XML, HTML, SOAP"
        },
        {
          "company": "United Health Systems",
          "description": "Developed two e-Learning modules to educate managers about how handle policy changes.",
          "details": ["Developed the framework to be scalable and reusable.", "Developed the modules to incorporate videos, a quiz, and to include reporting back to a .NET back end."],
          "used": "Adobe Flash, XML, HTML, SCORM, SOAP"
        },
        {
          "company": "Edward Jones Investments",
          "description": "Designed and developed e-Learning content.",
          "details": ["Upgraded an obsolete Flash framework in order to make it more flexible and efficient.", "Designed and developed various Flash and XML based e-Learning content that integrated with an existing LMS system."],
          "used": "Adobe Flash, XML, SCORM"
        }
      ]
    },
    {
      "company": "Motivation Technologies",
      "contract": false,
      "position": "Flash ActionScript 3 Developer",
      "location": "St. Louis, MO",
      "date": "August 2010 - February 2011",
      "description": "Designed and developed an entire Flash framework for Intel.",
      "details": ["Developed a framework for to integrate with a SCORM compliant .Net LMS using SOAP.", "Developed multiple e-Learning modules that supported multiple languages and included quizzes and quiz reporting."],
      "clients": [],
      "used": "Adobe Flash, XML, HTML, SCORM, SOAP"
    },
    {
      "company": "Laird Technologies",
      "contract": true,
      "position": "Web Developer",
      "location": "St. Louis, MO",
      "date": "June 2010 - July 2010",
      "description": "Helped manage an HTML and CSS based Content Management System.",
      "details": ["Updated HTML code to add and remove products from online catalog."],
      "clients": [],
      "used": "HTML, CSS"
    },
    {
      "company": "Real Estate Educate",
      "contract": false,
      "position": "Flash ActionScript 3 Developer",
      "location": "St. Louis, MO",
      "date": "August 2009 - May 2010",
      "description": "Designed and developed an e-Learning content.",
      "details": [
        "Rebuilt an obsolete ActionScript 2 framework into ActionScript 3 in order to make it more flexible and speed up development.",
        "Designed and developed Flash and XML based e-Learning courses to teach various topics related to the real estate market.",
        "Designed and developed websites for a variety of high profile clients."
      ],
      "clients": [],
      "used": "Adobe Flash, XML, HTML, CSS"
    },
    {
      "company": "MasterKey Consulting",
      "contract": false,
      "position": "Interactive Designer / Developer",
      "location": "St. Louis, MO",
      "date": "December 2008 - April 2009",
      "description": "Designed and developed interactive media.",
      "details": ["Designed and developed HTML, CSS, and JavaScript based websites for commercial clients and the Department of Defense’s Privacy and Civil Liberties Office.", "Developed medical education software for Elsevier."],
      "clients": [],
      "used": "HTML, CSS, JavaScript, Adobe Flash, XML"
    }
  ],
  "Education": {
    "M.F.A. Interactive Media": {
      "name": "Memphis College of Art",
      "location": "Memphis Tennessee (2004)"
    },
    "B.F.A. Graphic Design": {
      "name": "University of Missouri Saint Louis",
      "location": "Saint Louis, Missouri (2002)"
    }
  },
  "Achievements": {
    "a1": "Eagle Scout, Boy Scouts of America, (1993)",
    "a2": "Chair of the Emerging Professionals Group, (2017-2018)"
  }
}
