{
  "Profile": "Seasoned Front-End Web Developer with over 15+ years of experience delivering high-quality, user-centered digital solutions across diverse industries and technology. Proven expertise in React, JavaScript, TypeScript, HTML/CSS, and modern UI frameworks such as Next.js and AngularJS. Skilled in building scalable, accessible interfaces, leading development teams, and implementing reusable component libraries. Adept at driving performance, mentoring junior engineers, and streamlining development through Agile methodologies and testing best practices. Passionate about continuous learning, innovation, and delivering seamless user experiences across platforms.",
  "Technologies": {
    "Languages": "TypeScript, JavaScript, HTML, CSS, JSON, XML",
    "Tools / Libraries": "React, Redux, NextJS, AngularJS, SCSS, WordPress, Node, Express, Tailwind, jQuery, Bootstrap, Material, Formik, ESLint, Webpack, Jest, GIT, GitLab, Bitbucket, Agile, Scrum, Kanban Methodologies",
    "Software": "WebStorm, Visual Studio Code, Fiddler, Postman, Adobe Photoshop, Adobe Illustrator, Adobe XD, Confluence, JIRA",
    "Operating Systems": "Windows, Mac OS"
  },
  "IndustryExperience": "Energy, Restaurant, Communication, Commodity Trading, Sports, Healthcare, Pharmacy Tech, Insurance, Integrated Digital Technologies, Marketing, Financial, Education, Automotive, Railroad, and Beverage",
  "Competencies": "My competencies encompass a broad spectrum of UI Design and Development, UI Architecture, Project Design and Development, Framework Development, Object-Oriented Programming, User Experience (UX), and Usability. This comprehensive skill set enables me to deliver high-quality solutions across various platforms.",
  "Experience": [
    {
      "company": "Optum Rx",
      "contract": true,
      "position": "Front-end Developer",
      "location": "St. Louis, MO",
      "date": "February 2025 - June 2025",
      "description": "Participated in the building of the front end for an AI project.",
      "details": [
        "Collaborated with a team of UI developers to implement a Next.js UI for an AI-driven application using Agile methodologies.",
        "Mentored a junior developer, by teaching React and component strategies, provided guidance on best practices and code reviews.",
        "Engineered a creative solution to integrate a non-native dropdown menu with the Formik library, demonstrating creative problem-solving and adaptability."
      ],
      "clients": [],
      "key": 10,
      "used": "Agile, Nextjs, Bootstrap, TypeScript, Tailwind, ESLINT, Playright, Formik, GitHub"
    },
    {
      "company": "Lutheran Church Missouri Synod",
      "contract": false,
      "position": "Product Designer/Developer",
      "location": "St. Louis, MO",
      "date": "June 2023 - October 2023",
      "description": "Led the redesign and development of their Prayer Cards website.",
      "details": [
        "Led the redesign of the Prayer Cards website, significantly improving usability, accessibility, and visual design; presented to stakeholders and received strong approval.",
        "Resolved major Bootstrap and mobile compatibility issues across four public-facing websites, boosting accessibility and user experience.",
        "Refactored and updated the Bootstrap codebase to fix grid-related bugs with custom CSS, ensuring consistent performance across devices.",
        "Utilized design tools like Adobe XD, Illustrator, and Photoshop to align UI/UX improvements with brand and accessibility standards."
      ],
      "clients": [],
      "key": 9,
      "used": "Agile, React, HTML, Bootstrap, TypeScript, SCSS, CSS, ESLint, Jest, Git, Adobe XD, Illustrator, Photoshop"
    },
    {
      "company": "Charter Spectrum",
      "contract": true,
      "position": "Senior Software Engineer 1",
      "location": "St. Louis, MO",
      "date": "November 2022 - December 2022",
      "description": "Led and mentored a team of software engineers to update an older class based Reactjs project with new functionality and better performance.",
      "details": [
        "Led a team to optimize React.js and Next.js applications, cutting development time by 32% through testing strategies and adoption of best practices.",
        "Mentored developers by teaching modern workflows, CSS fundamentals, and legacy React concepts to revive a stalled project.",
        "Improved code quality and consistency by integrating ESLint, Prettier, and Jest into the development pipeline.",
        "Applied Agile methodologies to enhance team collaboration, increase productivity, and ensure timely project delivery."
      ],
      "clients": [],
      "key": 8,
      "used": "Agile, NextJS, TypeScript, Module.CSS, HTML, ESLint, Prettier, Jest, Git"
    },
    {
      "company": "FLASHPOINT",
      "contract": false,
      "position": "Senior Software Engineer",
      "location": "St. Louis, MO",
      "date": "July 2022 - September 2022",
      "description": "Led multiple teams of software engineers to build a new Reactjs-based library and a new Reactjs product that will replace their outdated product.",
      "details": [
        "Led multiple teams at FlashPoint through full project lifecycles, from concept to successful implementation.",
        "Spearheaded the creation of a reusable front-end component library, accelerating development across teams.",
        "Ensured code quality and consistency by enforcing standards with ESLint, Prettier, and Jest.",
        "Employed Agile methodologies and modern technologies such as Next.js, TypeScript, and CSS Modules to deliver scalable solutions."
      ],
      "clients": [],
      "key": 7,
      "used": "Agile, NextJS, React, TypeScript, Module.CSS, HTML, Bootstrap, ESLint, Jest, Git"
    },
    {
      "company": "QUES",
      "contract": false,
      "position": "Senior UI Engineer",
      "location": "St. Louis, MO",
      "date": "October 2021 - July 2022",
      "description": "I worked with a team of developers to build and maintain different SAAS projects.",
      "details": [
        "Participated in the development of a React-based UML display tool, allowing users to build, edit, and save diagrams.",
        "Maintained and upgraded legacy AngularJS applications to ensure smooth integration with new React-based components.",
        "Implemented performance and UX improvements through strategic upgrades, maintaining high code quality with ESLint and Jest."
      ],
      "clients": [],
      "key": 6,
      "used": "Agile, React, AngularJS, TypeScript, SCSS, HTML, Bootstrap, ESLint, Jest, Git"
    },
    {
      "company": "Edward Jones",
      "contract": false,
      "position": "Senior Front End Developer",
      "location": "St. Louis, MO",
      "date": "March 2020 - October 2021",
      "description": "I worked with a team of Senior developers to mentor and aid other UI development teams using React.",
      "details": [
        "Spearheaded the development of reusable animated components, enhancing UI consistency and promoting code efficiency across multiple teams.",
        "Led workshops on React best practices, driving performance optimizations, and elevating code quality.",
        "Designed screen architectures and established testing standards, reducing redundant code while increasing test coverage and reliability."
      ],
      "clients": [],
      "key": 5,
      "used": "Agile, React, JavaScript, CSS, HTML, Redux, Bootstrap, ESLint, Prettier, Jest, Git"
    },
    {
      "company": "RGA",
      "contract": true,
      "position": "Senior Front End Developer",
      "location": "St. Louis, MO",
      "date": "July 2019 - March 2020",
      "description": "Led a team of software engineers to update the Aurora project from AngularJS to Reactjs and Redux, and give it a modern look using Material design.",
      "details": [
        "Led the team in migrating the Aurora project from AngularJS to React, significantly improving UI performance and system efficiency.",
        "Enhanced accessibility by resolving compliance issues, ensuring a more inclusive user experience.",
        "Provided hands-on training in React, CSS, and coding best practices to accelerate development timelines.",
        "Utilized Agile methodologies and testing frameworks like Jest to maintain high code quality and streamline workflows."
      ],
      "clients": [],
      "key": 4,
      "used": "Agile, React, AngularJS, JavaScript, TypeScript, HTML, CSS, Bootstrap, JSON, Jest, ESLint, Git"
    },
    {
      "company": "NECES",
      "contract": true,
      "position": "Senior UI Developer",
      "location": "St. Louis, MO",
      "date": "March 2019 - July 2019",
      "description": "Led a team of onshore and offshore UI software engineers to build the AUROS Command and AUROS Site Manger projects.",
      "details": [
        "Led the UI team to enhance AUROS project by establishing standards and comprehensive documentation, boosting development efficiency.",
        "Implemented Jest, Jasmine, and Karma to reduce bugs and improve overall software quality.",
        "Conducted operational reviews to streamline development processes, significantly decreasing post-production changes.",
        "Guided the team through architecture improvements and Angular 7 upgrades, successfully achieving key project milestones."
      ],
      "clients": [],
      "key": 3,
      "used": "Agile, Angular, TypeScript, CSS, HTML, Jasmine, Karma, Protractor, Webpack, Node"
    },
    {
      "company": "Panera Bread",
      "contract": true,
      "position": "Senior UI Developer",
      "location": "St. Louis, MO",
      "date": "March 2018 - March 2019",
      "description": "Development of Panera's new Point-of-Sale devices.",
      "details": [
        "Collaborated with the team of designers, frontend, and backend developers, and worked on developing the UI for the Point-of-Sale system used in their restaurants.",
        "Led the initiative to reorganize the code, standardize code patterns, and implement Jest to increase code coverage."
      ],
      "clients": [],
      "key": 2,
      "used": "Agile, React, Redux, Bootstrap, Axios, Saga, HTML, CSS, JavaScript, Jest"
    },
    {
      "company": "Daugherty Business Solutions",
      "contract": false,
      "position": "Software Engineer",
      "location": "St. Louis, MO",
      "date": "August 2013 - March 2018",
      "description": "Member of the Software Architecture and Engineering Line of Service.",
      "details": [],
      "used": "",
      "key": 1,
      "clients": [
        {
          "company": "Charter Communications",
          "description": "Redeveloped their Customer Service Management website.",
          "details": [
            "Redeveloped the Customer Service Management website as part of the Gateway Project, improving functionality, usability, and user experience.",
            "Resolved a complex Bootstrap dropdown menu bug by implementing a creative solution that allowed the dropdown to be used anywhere on the screen, regardless of how large the dropdown menu is, with the menu never going off screen. ---This was before Bootstrap’s dropdown had the built in functionality.",
            "Developed a custom event-based library for global state management using React, and JavaScript."
          ],
          "used": "Agile, React, JavaScript, HTML, CSS, Bootstrap, JSON, ESLINT, Git"
        },
        {
          "company": "Metal Exchange Corporation",
          "description": "Redeveloped their Trading System.",
          "details": [
            "Collaborated on rewriting critical Trading System components, migrating business logic to managed .NET code to boost system efficiency and maintainability.",
            "Styled HTML screens with CSS to improve user experience."
          ],
          "used": "Agile, .NET, C#, MSSQL Server, HTML, CSS, Visual Studio 2010, Fiddler"
        }
      ]
    }
  ],
  "Education": [
    {
      "Degree": "Master Of Fine Arts",
      "Major": "INTERACTIVE MEDIA",
      "University": "Memphis College of Art",
      "Location": "Memphis Tennessee"
    },
    {
      "Degree": "Bachelor Of Fine Arts",
      "Major": " GRAPHIC DESIGN",
      "University":"University of Missouri Saint Louis",
      "Location": "Saint Louis, Missouri"
    }
  ],
  "Achievements": [
    {
      "award": "EAGLE SCOUT",
      "date": "1993",
      "organization": "Boy Scouts of America"
    }
  ]
}
